/*
    Змінні та математичні оператори:
    Створіть змінну num1 і присвойте їй значення 10.
    Створіть другу змінну num2 і присвойте їй значення 5.
    Використовуючи математичні оператори (+,-,*,/), обчисліть суму, різницю, добуток та частку num та num2.
    Виведіть результати на екран.
*/

let num1 = 10;
let num2 = 5;

let sum1 = num1 + num2;
let diff = num1 - num2;
let prod = num1 * num2;
let quot = num1 / num2;

console.log("Task [1]");
console.log("Sum: " + sum1);
console.log("Diff: " + diff);
console.log("Prod: " + prod);
console.log("Quot: " + quot);

///////////////////////////////////////////////////////////////////////////////

/*
    Створіть масив з п`яти чисел.
    За допомогою циклу for виведіть на екран суму всіх елементів масиву.
*/

let numbers = [2, 5, 8, 3, 1];
let sum2 = 0;

for (let i = 0; i < numbers.length; i++) {
    sum2 += numbers[i];
}
console.log("\nTask [2]");
console.log("The sum of array numbers: " + sum2);

///////////////////////////////////////////////////////////////////////////////

/*
    Створіть функцію, яка приймає два параметри числа, та повертає їх суму.
    Викличте функцію з довільними значеннями та виведіть результат на екран.
*/

function sum(a, b) {
    return a + b;
}

// Виклик функції з довільними параметрами
let result = sum(10, 5);

console.log("\nTask [3]");
console.log("The result of adding: " + result);

///////////////////////////////////////////////////////////////////////////////

/*
    Створіть функцію, яка приймає один параметр - число n, та повертає масив з першими n числами Фібоначчі.
    Використовуючи цикл та функцію, виведіть на екран перші 10 чисел Фібоначчі.
*/

console.log("\nTask [4]");

function fibonacciArray(n) {
    let arr = [];
    for (let i = 0; i <= n; i++) {
        if (i === 0) {
            arr.push(0);
        } else if (i === 1) {
            arr.push(1);
        } else {
            arr.push(arr[i - 1] + arr[i - 2]);
        }
    }
    return arr;
}

console.log(fibonacciArray(10) + "...");
